<!-- placeholder-1 -->
```fish
terraform plan -chdir='terraform/production/vpc'
```
<!-- placeholder-2 -->

<details><summary>Diff of changes.</summary>

```diff
+ aws_instance.a4l_bastion will be created
+ aws_instance.a4l_internal will be created
+ aws_key_pair.a4l will be created
+ aws_security_group.bastion will be created
+ aws_security_group.internal will be created
+ aws_security_group_rule.bastion_egress["10.16.160.0/20"] will be created
+ aws_security_group_rule.bastion_egress["10.16.32.0/20"] will be created
+ aws_security_group_rule.bastion_egress["10.16.96.0/20"] will be created
+ aws_security_group_rule.bastion_ingress["192.0.2.1/32"] will be created
+ aws_security_group_rule.internal_egress will be created
+ aws_security_group_rule.internal_ingress will be created
! module.vpc.aws_db_subnet_group.database[0] must be replaced
! module.vpc.aws_default_network_acl.this[0] will be updated in-place
! module.vpc.aws_default_route_table.default[0] will be updated in-place
! module.vpc.aws_default_security_group.this[0] will be updated in-place
! module.vpc.aws_internet_gateway.this[0] will be updated in-place
! module.vpc.aws_route_table.private[0] will be updated in-place
! module.vpc.aws_route_table.private[1] will be updated in-place
! module.vpc.aws_route_table.private[2] will be updated in-place
! module.vpc.aws_route_table.public[0] will be updated in-place
! module.vpc.aws_subnet.database[0] will be updated in-place
! module.vpc.aws_subnet.database[1] will be updated in-place
! module.vpc.aws_subnet.database[2] will be updated in-place
! module.vpc.aws_subnet.private[0] will be updated in-place
! module.vpc.aws_subnet.private[1] will be updated in-place
! module.vpc.aws_subnet.private[2] will be updated in-place
! module.vpc.aws_subnet.public[0] will be updated in-place
! module.vpc.aws_subnet.public[1] will be updated in-place
! module.vpc.aws_subnet.public[2] will be updated in-place
! module.vpc.aws_vpc.this[0] will be updated in-place
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 12 to add, 18 to change, 1 to destroy.</br>

<!-- placeholder-4 -->
###### By @chris3ware at 2024-11-01T09:59:40Z [(view log)](https://github.com/3ware/aws-network-speciality/actions/runs/11627628041/job/32381311276#step:16:1).
</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.a4l_bastion will be created
  + resource "aws_instance" "a4l_bastion" {
      + ami                                  = "ami-033b95fb8079dc481"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "A4L"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-0e3411faf4f92849f"
      + tags                                 = {
          + "Name" = "A4L-BASTION"
        }
      + tags_all                             = {
          + "3ware:environment"          = "development"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "aws-network-speciality"
          + "3ware:service"              = "vpc"
          + "3ware:workspace"            = "vpc-us-east-1-production"
          + "Name"                       = "A4L-BASTION"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # aws_instance.a4l_internal will be created
  + resource "aws_instance" "a4l_internal" {
      + ami                                  = "ami-033b95fb8079dc481"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "A4L"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-0aa75a1a27f638154"
      + tags                                 = {
          + "Name" = "A4L-INTERNAL-TEST"
        }
      + tags_all                             = {
          + "3ware:environment"          = "development"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "aws-network-speciality"
          + "3ware:service"              = "vpc"
          + "3ware:workspace"            = "vpc-us-east-1-production"
          + "Name"                       = "A4L-INTERNAL-TEST"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # aws_key_pair.a4l will be created
  + resource "aws_key_pair" "a4l" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "A4L"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIMNSplDEGibL7tUs87JsuwnHmDA2uSB+M2kUlOQuI0Fc"
      + tags_all        = {
          + "3ware:environment"          = "development"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "aws-network-speciality"
          + "3ware:service"              = "vpc"
          + "3ware:workspace"            = "vpc-us-east-1-production"
        }
    }

  # aws_security_group.bastion will be created
  + resource "aws_security_group" "bastion" {
      + arn                    = (known after apply)
      + description            = "Security Group for A4L Bastion Host"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "A4L-BASTION"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "A4L-BASTION"
        }
      + tags_all               = {
          + "3ware:environment"          = "development"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "aws-network-speciality"
          + "3ware:service"              = "vpc"
          + "3ware:workspace"            = "vpc-us-east-1-production"
          + "Name"                       = "A4L-BASTION"
        }
      + vpc_id                 = "vpc-0ddf79e0777aa73d1"
    }

  # aws_security_group.internal will be created
  + resource "aws_security_group" "internal" {
      + arn                    = (known after apply)
      + description            = "Security Group for A4L internal Host"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "A4L-INTERNAL"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "A4L-INTERNAL"
        }
      + tags_all               = {
          + "3ware:environment"          = "development"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "aws-network-speciality"
          + "3ware:service"              = "vpc"
          + "3ware:workspace"            = "vpc-us-east-1-production"
          + "Name"                       = "A4L-INTERNAL"
        }
      + vpc_id                 = "vpc-0ddf79e0777aa73d1"
    }

  # aws_security_group_rule.bastion_egress["10.16.160.0/20"] will be created
  + resource "aws_security_group_rule" "bastion_egress" {
      + cidr_blocks              = [
          + "10.16.160.0/20",
        ]
      + description              = "Outbound traffic private subnets"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "egress"
    }

  # aws_security_group_rule.bastion_egress["10.16.32.0/20"] will be created
  + resource "aws_security_group_rule" "bastion_egress" {
      + cidr_blocks              = [
          + "10.16.32.0/20",
        ]
      + description              = "Outbound traffic private subnets"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "egress"
    }

  # aws_security_group_rule.bastion_egress["10.16.96.0/20"] will be created
  + resource "aws_security_group_rule" "bastion_egress" {
      + cidr_blocks              = [
          + "10.16.96.0/20",
        ]
      + description              = "Outbound traffic private subnets"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "egress"
    }

  # aws_security_group_rule.bastion_ingress["192.0.2.1/32"] will be created
  + resource "aws_security_group_rule" "bastion_ingress" {
      + cidr_blocks              = [
          + "192.0.2.1/32",
        ]
      + description              = "Inbound traffic to bastion hosts"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # aws_security_group_rule.internal_egress will be created
  + resource "aws_security_group_rule" "internal_egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Outbound traffic from internal hosts"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # aws_security_group_rule.internal_ingress will be created
  + resource "aws_security_group_rule" "internal_ingress" {
      + description              = "Inbound traffic to internal hosts"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.vpc.aws_db_subnet_group.database[0] must be replaced
-/+ resource "aws_db_subnet_group" "database" {
      ~ arn                     = "arn:aws:rds:us-east-1:535002868697:subgrp:a4l-vpc1-production" -> (known after apply)
      ~ description             = "Database subnet group for a4l-vpc1-production" -> "Database subnet group for a4l-vpc1-development"
      ~ id                      = "a4l-vpc1-production" -> (known after apply)
      ~ name                    = "a4l-vpc1-production" -> "a4l-vpc1-development" # forces replacement
      + name_prefix             = (known after apply)
      ~ supported_network_types = [
          - "IPV4",
        ] -> (known after apply)
      ~ tags                    = {
          - "3ware:environment" = "production" -> null
          ~ "Name"              = "a4l-vpc1-production" -> "a4l-vpc1-development"
        }
      ~ tags_all                = {
          ~ "3ware:environment"          = "production" -> "development"
          ~ "Name"                       = "a4l-vpc1-production" -> "a4l-vpc1-development"
            # (4 unchanged elements hidden)
        }
      ~ vpc_id                  = "vpc-0ddf79e0777aa73d1" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_default_network_acl.this[0] will be updated in-place
  ~ resource "aws_default_network_acl" "this" {
        id                     = "acl-0cf82e496bbc30ffd"
      ~ tags                   = {
          - "3ware:environment" = "production" -> null
          ~ "Name"              = "a4l-vpc1-production-default" -> "a4l-vpc1-development-default"
        }
      ~ tags_all               = {
          ~ "3ware:environment"          = "production" -> "development"
          ~ "Name"                       = "a4l-vpc1-production-default" -> "a4l-vpc1-development-default"
            # (4 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.vpc.aws_default_route_table.default[0] will be updated in-place
  ~ resource "aws_default_route_table" "default" {
        id                     = "rtb-0549911276b539493"
      ~ tags                   = {
          - "3ware:environment" = "production" -> null
          ~ "Name"              = "a4l-vpc1-production-default" -> "a4l-vpc1-development-default"
        }
      ~ tags_all               = {
          ~ "3ware:environment"          = "production" -> "development"
          ~ "Name"                       = "a4l-vpc1-production-default" -> "a4l-vpc1-development-default"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_default_security_group.this[0] will be updated in-place
  ~ resource "aws_default_security_group" "this" {
        id                     = "sg-04bf2d1c74df422ce"
        name                   = "default"
      ~ tags                   = {
          - "3ware:environment" = "production" -> null
          ~ "Name"              = "a4l-vpc1-production-default" -> "a4l-vpc1-development-default"
        }
      ~ tags_all               = {
          ~ "3ware:environment"          = "production" -> "development"
          ~ "Name"                       = "a4l-vpc1-production-default" -> "a4l-vpc1-development-default"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_internet_gateway.this[0] will be updated in-place
  ~ resource "aws_internet_gateway" "this" {
        id       = "igw-012bc67dd079aad6d"
      ~ tags     = {
          - "3ware:environment" = "production" -> null
          ~ "Name"              = "a4l-vpc1-production" -> "a4l-vpc1-development"
        }
      ~ tags_all = {
          ~ "3ware:environment"          = "production" -> "development"
          ~ "Name"                       = "a4l-vpc1-production" -> "a4l-vpc1-development"
            # (4 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0f77c9fb43f70d1b8"
      ~ tags             = {
          - "3ware:environment" = "production" -> null
          ~ "Name"              = "a4l-vpc1-production-private-us-east-1a" -> "a4l-vpc1-development-private-us-east-1a"
        }
      ~ tags_all         = {
          ~ "3ware:environment"          = "production" -> "development"
          ~ "Name"                       = "a4l-vpc1-production-private-us-east-1a" -> "a4l-vpc1-development-private-us-east-1a"
            # (4 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[1] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0c39668cb77efd10a"
      ~ tags             = {
          - "3ware:environment" = "production" -> null
          ~ "Name"              = "a4l-vpc1-production-private-us-east-1b" -> "a4l-vpc1-development-private-us-east-1b"
        }
      ~ tags_all         = {
          ~ "3ware:environment"          = "production" -> "development"
          ~ "Name"                       = "a4l-vpc1-production-private-us-east-1b" -> "a4l-vpc1-development-private-us-east-1b"
            # (4 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[2] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-04794b05ee62e3499"
      ~ tags             = {
          - "3ware:environment" = "production" -> null
          ~ "Name"              = "a4l-vpc1-production-private-us-east-1c" -> "a4l-vpc1-development-private-us-east-1c"
        }
      ~ tags_all         = {
          ~ "3ware:environment"          = "production" -> "development"
          ~ "Name"                       = "a4l-vpc1-production-private-us-east-1c" -> "a4l-vpc1-development-private-us-east-1c"
            # (4 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.public[0] will be updated in-place
  ~ resource "aws_route_table" "public" {
        id               = "rtb-06f3d757f92ce7efc"
      ~ tags             = {
          - "3ware:environment" = "production" -> null
          ~ "Name"              = "a4l-vpc1-production-public" -> "a4l-vpc1-development-public"
        }
      ~ tags_all         = {
          ~ "3ware:environment"          = "production" -> "development"
          ~ "Name"                       = "a4l-vpc1-production-public" -> "a4l-vpc1-development-public"
            # (4 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.database[0] will be updated in-place
  ~ resource "aws_subnet" "database" {
        id                                             = "subnet-0f8a96f543dec9faf"
      ~ tags                                           = {
          - "3ware:environment" = "production" -> null
          ~ "Name"              = "a4l-vpc1-production-db-us-east-1a" -> "a4l-vpc1-development-db-us-east-1a"
        }
      ~ tags_all                                       = {
          ~ "3ware:environment"          = "production" -> "development"
          ~ "Name"                       = "a4l-vpc1-production-db-us-east-1a" -> "a4l-vpc1-development-db-us-east-1a"
            # (4 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.database[1] will be updated in-place
  ~ resource "aws_subnet" "database" {
        id                                             = "subnet-0d08be973824168f7"
      ~ tags                                           = {
          - "3ware:environment" = "production" -> null
          ~ "Name"              = "a4l-vpc1-production-db-us-east-1b" -> "a4l-vpc1-development-db-us-east-1b"
        }
      ~ tags_all                                       = {
          ~ "3ware:environment"          = "production" -> "development"
          ~ "Name"                       = "a4l-vpc1-production-db-us-east-1b" -> "a4l-vpc1-development-db-us-east-1b"
            # (4 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.database[2] will be updated in-place
  ~ resource "aws_subnet" "database" {
        id                                             = "subnet-0abc0474eca6532ff"
      ~ tags                                           = {
          - "3ware:environment" = "production" -> null
          ~ "Name"              = "a4l-vpc1-production-db-us-east-1c" -> "a4l-vpc1-development-db-us-east-1c"
        }
      ~ tags_all                                       = {
          ~ "3ware:environment"          = "production" -> "development"
          ~ "Name"                       = "a4l-vpc1-production-db-us-east-1c" -> "a4l-vpc1-development-db-us-east-1c"
            # (4 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[0] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-0f04298c4231d19f7"
      ~ tags                                           = {
          - "3ware:environment" = "production" -> null
          ~ "Name"              = "a4l-vpc1-production-private-us-east-1a" -> "a4l-vpc1-development-private-us-east-1a"
        }
      ~ tags_all                                       = {
          ~ "3ware:environment"          = "production" -> "development"
          ~ "Name"                       = "a4l-vpc1-production-private-us-east-1a" -> "a4l-vpc1-development-private-us-east-1a"
            # (4 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[1] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-0aa75a1a27f638154"
      ~ tags                                           = {
          - "3ware:environment" = "production" -> null
          ~ "Name"              = "a4l-vpc1-production-private-us-east-1b" -> "a4l-vpc1-development-private-us-east-1b"
        }
      ~ tags_all                                       = {
          ~ "3ware:environment"          = "production" -> "development"
          ~ "Name"                       = "a4l-vpc1-production-private-us-east-1b" -> "a4l-vpc1-development-private-us-east-1b"
            # (4 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[2] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-05ebc7396e2069017"
      ~ tags                                           = {
          - "3ware:environment" = "production" -> null
          ~ "Name"              = "a4l-vpc1-production-private-us-east-1c" -> "a4l-vpc1-development-private-us-east-1c"
        }
      ~ tags_all                                       = {
          ~ "3ware:environment"          = "production" -> "development"
          ~ "Name"                       = "a4l-vpc1-production-private-us-east-1c" -> "a4l-vpc1-development-private-us-east-1c"
            # (4 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[0] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-0e3411faf4f92849f"
      ~ tags                                           = {
          - "3ware:environment" = "production" -> null
          ~ "Name"              = "a4l-vpc1-production-public-us-east-1a" -> "a4l-vpc1-development-public-us-east-1a"
        }
      ~ tags_all                                       = {
          ~ "3ware:environment"          = "production" -> "development"
          ~ "Name"                       = "a4l-vpc1-production-public-us-east-1a" -> "a4l-vpc1-development-public-us-east-1a"
            # (4 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[1] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-0f6ebe27b0457a0ac"
      ~ tags                                           = {
          - "3ware:environment" = "production" -> null
          ~ "Name"              = "a4l-vpc1-production-public-us-east-1b" -> "a4l-vpc1-development-public-us-east-1b"
        }
      ~ tags_all                                       = {
          ~ "3ware:environment"          = "production" -> "development"
          ~ "Name"                       = "a4l-vpc1-production-public-us-east-1b" -> "a4l-vpc1-development-public-us-east-1b"
            # (4 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[2] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-00f7fa19cf1124e1e"
      ~ tags                                           = {
          - "3ware:environment" = "production" -> null
          ~ "Name"              = "a4l-vpc1-production-public-us-east-1c" -> "a4l-vpc1-development-public-us-east-1c"
        }
      ~ tags_all                                       = {
          ~ "3ware:environment"          = "production" -> "development"
          ~ "Name"                       = "a4l-vpc1-production-public-us-east-1c" -> "a4l-vpc1-development-public-us-east-1c"
            # (4 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # module.vpc.aws_vpc.this[0] will be updated in-place
  ~ resource "aws_vpc" "this" {
        id                                   = "vpc-0ddf79e0777aa73d1"
      ~ tags                                 = {
          - "3ware:environment" = "production" -> null
          ~ "Name"              = "a4l-vpc1-production" -> "a4l-vpc1-development"
        }
      ~ tags_all                             = {
          ~ "3ware:environment"          = "production" -> "development"
          ~ "Name"                       = "a4l-vpc1-production" -> "a4l-vpc1-development"
            # (4 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)
    }

Plan: 12 to add, 18 to change, 1 to destroy.

Changes to Outputs:
  + bastion_hostname = (known after apply)
```
</details>
<!-- placeholder-5 -->
<!-- terraform.55...chdir..terraform.production.vpc..tf.plan -->
<!-- placeholder-6 -->